Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryOptionSeparate Property
 Option Conflict between Rooms.\nRoom boundary differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictBoundariesVaryOptionSeparate { get; }
Public Shared ReadOnly Property OptionConflictBoundariesVaryOptionSeparate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictBoundariesVaryOptionSeparate {
	FailureDefinitionId^ get ();
}
static member OptionConflictBoundariesVaryOptionSeparate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace